taurus/get-quick-message.yml
artifacts-dir: ./taurus-result

execution:
  - concurrency: 5
    hold-for: 30s
    ramp-up: 5s
    scenario: get-quick-message

scenarios:
  get-quick-message:
    requests:
      - url: http://localhost:5000/api/message  # <== use service name, not localhost
        method: GET
        headers:
          Accept: application/json

reporting:
  - module: console
  - module: final-stats
  - module: junit-xml
    filename: ./taurus-result/taurus-report.xml
  - module: blazemeter
    project: "jmeter-taurus-blazemeter-react-demo-project"
    report-name: "Get Quick Message API Test"
    test: "get-quick-message-test"